InformationRegisters/Renault_НормализованныеКонтактыДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НормализованныеКонтактыДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/DMS_ФормаПодобныхКонтрагентов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВключатьПотенциальных = Ложь;
	
	Если Параметры.Свойство("ВключатьПотенциальных") Тогда
		
		ВключатьПотенциальных = Параметры.ВключатьПотенциальных;
		
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагенты") Тогда
	
		Для каждого КонтрагентПодобный Из Параметры.Контрагенты Цикл
			
			Если НЕ ВключатьПотенциальных Тогда
			
				Если НЕ ТипЗнч(КонтрагентПодобный) = Тип("СправочникСсылка.Контрагенты") Тогда Продолжить КонецЕсли;
				
			КонецЕсли;
		
			НоваяСтрока = ПодобныеКонтрагенты.Добавить();
			НоваяСтрока.Контрагент = КонтрагентПодобный;
			
			КонтактнаяИнформацияКонтрагента = ПолучитьКИКонтрагента(КонтрагентПодобный);
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,КонтактнаяИнформацияКонтрагента);
			
			Если Не ПустаяСтрока(КонтрагентПодобный.ОсновнойТелефон) Тогда
				НоваяСтрока.Телефон = СокрЛП(КонтрагентПодобный.ОсновнойТелефон);
			КонецЕсли; 
		     	
		КонецЦикла; 
	
	КонецЕсли; 
	                      
	Если Параметры.Свойство("Заголовок") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли; 
	
	Если Параметры.Свойство("Подсказка") Тогда
		Элементы.ДекорацияПояснение.Заголовок = Параметры.Подсказка;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ЕстьВыбранный = Ложь;
	
	Для каждого ТекущаяСтрока Из ПодобныеКонтрагенты Цикл
	
		Если ТекущаяСтрока.Выбрать Тогда
		
			ЕстьВыбранный = Истина;
			
			ОповеститьОВыборе(ТекущаяСтрока.Контрагент);
			
			Прервать;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если Не ЕстьВыбранный Тогда
		Предупреждение("Выберите контрагента",15,"Не выбран контрагент");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобныеКонтрагентыВыбратьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПодобныеКонтрагенты.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаТЧ Из ПодобныеКонтрагенты Цикл
		Если СтрокаТЧ <> ТекущаяСтрока Тогда
			СтрокаТЧ.Выбрать = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПодобныеКонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПодобныеКонтрагентыПередУдалением(Элемент, Отказ)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПодобныеКонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	//Режим = РежимДиалогаВопрос.ДаНет;
	//Ответ = Вопрос("Выбрать: "+"'"+СокрЛП(ТекущаяСтрока.Контрагент)+"'"+" ?", Режим, 0);
	//
	//Если Ответ = КодВозвратаДиалога.Нет Тогда
	//	Возврат;
	//КонецЕсли;
	
	Для каждого СтрокаТЧ Из ПодобныеКонтрагенты Цикл
		Если СтрокаТЧ <> ТекущаяСтрока Тогда
			СтрокаТЧ.Выбрать = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	ОповеститьОВыборе(ТекущаяСтрока.Контрагент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКИКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	"""" КАК АдресЭлектроннойПочты,
		|	НормализованныеКонтакты.Телефон КАК Телефон
		|ПОМЕСТИТЬ КИ
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтакты
		|ГДЕ
		|	(ВЫРАЗИТЬ(НормализованныеКонтакты.Объект КАК Справочник.Контрагенты)) = &Контрагент
		|	И НормализованныеКонтакты.Телефон <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	НормализованныеКонтакты.АдресЭлектроннойПочты,
		|	""""
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтакты
		|ГДЕ
		|	(ВЫРАЗИТЬ(НормализованныеКонтакты.Объект КАК Справочник.Контрагенты)) = &Контрагент
		|	И НормализованныеКонтакты.АдресЭлектроннойПочты <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(КИ.АдресЭлектроннойПочты) КАК АдресЭлектроннойПочты,
		|	МАКСИМУМ(КИ.Телефон) КАК Телефон
		|ИЗ
		|	КИ КАК КИ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураКИ = Новый Структура("Телефон,АдресЭлектроннойПочты","","");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКИ,ВыборкаДетальныеЗаписи);
	КонецЕсли; 
	
	Возврат СтруктураКИ;
	
КонецФункции // ПолучитьКИКонтрагента()
